// ایجاد یک "سازنده" (Builder) برای برنامه وب ما. 
// این خط به صورت خودکار تنظیمات اولیه مثل لاگ‌گیری، خواندن فایل‌های تنظیمات (appsettings.json) و آماده‌سازی سرور را انجام می‌دهد.
var builder = WebApplication.CreateBuilder(args);

// ساخت نهایی و ایجاد شیء اصلی برنامه (WebApplication) با استفاده از تنظیماتی که در خط قبل اعمال شده بود.
var app = builder.Build();

// تعریف یک "میدل‌ویر" (Middleware) به صورت اینلاین.
// این بلاک کد به این معنی است که: "هر درخواست (Request) که به سرور من بیاید، این تابع را اجرا کن".
// از کلمه کلیدی async استفاده شده چون در عملیات شبکه (نوشتن در پاسخ) از کدهای غیرهمزمان (Async) استفاده می‌کنیم.
app.Run(async (HttpContext context) =>
{
    // استخراج مسیر (Path) درخواست شده توسط کاربر.
    // مثلاً اگر کاربر به آدرس "https://mysite.com/users/list" درخواست بدهد، مقدار این متغیر "/users/list" می‌شود.
    string path = context.Request.Path;

    // استخراج متد (Method) ارسال شده در درخواست HTTP.
    // متدها معمولاً شامل GET (دریافت اطلاعات)، POST (ارسال اطلاعات)، PUT (بروزرسانی) و DELETE (حذف) هستند.
    string method = context.Request.Method;

    // تنظیم هدرهای (Headers) پاسخ سرور به مرورگر.
    // با تنظیم "Content-type" به "text/html"، به مرورگر می‌گوییم که محتوایی که برمی‌گردانیم یک سند HTML است 
    // تا مرورگر آن را به عنوان کد HTML تفسیر کند و تگ‌ها را اجرا کند (نه اینکه آن‌ها را به صورت متن ساده نشان دهد).
    context.Response.Headers["Content-type"] = "text/html";
    //OR
    //context.Response.ContentType = "text/html";

    // نوشتن در بدنه (Body) پاسخ HTTP و ارسال آن به سمت کاربر.
    // از علامت $ برای String Interpolation استفاده شده تا بتوانیم متغیرها را داخل رشته قرار دهیم.
    // کلمه کلیدی await باعث می‌شود برنامه متوقف نشود و منتظر بماند تا عملیات نوشتن در شبکه به پایان برسد.
    await context.Response.WriteAsync($"<p>{path}</p>");

    // نوشتن متد درخواست در خروجی با استفاده از تگ پاراگراف HTML
    await context.Response.WriteAsync($"<p>{method}</p>");
});

// اجرای برنامه. از این خط به بعد، سرور شروع به گوش دادن (Listening) روی پورت مشخص شده (معمولاً پورت 5000 در محیط توسعه) می‌کند 
// و آماده دریافت درخواست‌های کلاینت‌ها (مثل مرورگر) است.
app.Run();