namespace ServiceContracts
{

    //تعریف یک کلاس با روش قدیمی چهار مشکل دارد:
    //1- برنامه نویس سطح بالاتر باید منتظر تکمیل کلاس CitiesService بماند
    //2- تغییرات در کلاس های سطح‌پایینِ ، نیازمند حجم زیادی از کدنویسی  در کل برنامه میشد.
    //3- هر تغییر ایجاد شده در کد های سطح پایین بر روی کد های سطح بالا تاثیر میگذارد
    //4- فرآیند تست یک ماژول بدون تاثیر یا تست ماژول های دیگر سخت میشود
    // 5- وابستگی محکم (Tight Coupling) :
    // کلاس  OrderService مستقیماً به کلاس SqlOrderRepository وابسته بود.
    // اگر می‌خواستید نوع دیتابیس را تغییر دهید ، مجبور بودید کد کلاس اصلی را تغییر دهید.
    // برای حل این مشکل اینترفیس اراپه شد که :
    // ۱- وابستگی فقط به اینترفیس (Abstraction)
    // ۲- امکان تزریق Mock/Fake به‌راحتی برای تست فراهم شده است
    // ۳- مدیریت چرخه‌ی حیات :	کانتینر DI مدیریت Singleton/Scoped/Transient را خودکار انجام می‌دهد 
    // ۴- تغییر پیاده‌سازی فقط در یک خط Registration

    public interface ICitiesService
  {

    List<string> GetCities();
  }
}